[options]
mode cover
depth 100

[engines]
smtbmc boolector

[script]
verilog_defines -D RISCV_FORMAL
verilog_defines -D RISCV_FORMAL_NRET=1
verilog_defines -D RISCV_FORMAL_XLEN=32
verilog_defines -D RISCV_FORMAL_ILEN=32
verilog_defines -D RISCV_FORMAL_ALIGNED_MEM
read_verilog rvfi_macros.vh
read_verilog minrv32.v
read_verilog -sv -formal cover.sv
prep -nordff -top testbench

[files]
../../riscv-formal/checks/rvfi_macros.vh
../minrv32.v
cover.sv
